In [1]:
import pandas as pd
import numpy as np

# 1. Create a Dataframe

In [2]:
df1=pd.DataFrame([1,2,3],[4,5,6])
df1

   0
4  1
5  2
6  3

In [3]:
df2=pd.DataFrame([[1,2,3],[4,5,6]])
df2

   0  1  2
0  1  2  3
1  4  5  6

In [4]:
df2=pd.DataFrame([[1,2,3],[4,5,6]], index = ['row1','row2'],columns = ['c1','c2','c3'])
df2

      c1  c2  c3
row1   1   2   3
row2   4   5   6

In [5]:
dates = pd.date_range('2021-06-16', periods =7)
df3 = pd.DataFrame(np.random.randn(7,4),index =dates, columns = list('abcd'))
df3

                   a         b         c         d
2021-06-16 -0.837977  0.419507  0.192403  0.462076
2021-06-17  0.588085 -0.205135 -2.430042 -1.944620
2021-06-18  2.373115 -0.635778  0.513441  1.107934
2021-06-19 -0.767461 -0.718166  0.463211 -1.597073
2021-06-20  0.976682  1.505626  1.485973  1.085714
2021-06-21  1.342646  0.341569 -0.391456  1.691873
2021-06-22 -0.013071 -0.022593 -0.123208 -0.308767

In [6]:
df4 = pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})
df4

   a  b
0  1  4
1  2  5
2  3  6

In [7]:
df5 = pd.DataFrame({'Beijing':{'2017':1,'2018':2},'Shanghai':{'2017':1,'2018':2}})
df5

      Beijing  Shanghai
2017        1         1
2018        2         2

In [8]:
a1 = pd.Series(range(5))
b1 = pd.Series(np.linspace(4,20,5))
df6 = pd.concat([a1,b1],axis = 1)
df6

   0     1
0  0   4.0
1  1   8.0
2  2  12.0
3  3  16.0
4  4  20.0

In [9]:
df7=pd.DataFrame()
index = list('abcde')
for i in range(5):
    a2 = pd.DataFrame([np.linspace(i,5*i,5)], index = [index[i]])
    df7 = df7.append(a2)
df7

     0    1     2     3     4
a  0.0  0.0   0.0   0.0   0.0
b  1.0  2.0   3.0   4.0   5.0
c  2.0  4.0   6.0   8.0  10.0
d  3.0  6.0   9.0  12.0  15.0
e  4.0  8.0  12.0  16.0  20.0

In [10]:
print(df7.iloc[0])
print(df7.iloc[:,[0]])

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
Name: a, dtype: float64
     0
a  0.0
b  1.0
c  2.0
d  3.0
e  4.0

In [11]:
print(df7.loc['a'])
print(df7.loc[:,[0]])

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
Name: a, dtype: float64
     0
a  0.0
b  1.0
c  2.0
d  3.0
e  4.0

In [12]:
print(df7.iat[2,3])
print(df7.at['d',3])

8.0
12.0

In [13]:
# Pandas 的 data frame 資料結構有一些方法或屬性

import pandas as pd

groups = ["Movies", "Sports", "Coding", "Fishing", "Dancing", "cooking"]  
num = [46, 8, 12, 12, 6, 58]

dict = {"groups": groups,  
        "num": num
        }


select_df = pd.DataFrame(dict)

print(select_df.shape) # 回傳列數與欄數  
print("---")  
print(select_df.describe()) # 回傳描述性統計  
print("---")  
print(select_df.head(3)) # 回傳前三筆觀測值  
print("---")  
print(select_df.tail(3)) # 回傳後三筆觀測值  
print("---")  
print(select_df.columns) # 回傳欄位名稱  
print("---")  
print(select_df.index) # 回傳 index  
print("---")  
print(select_df.info) # 回傳資料內容

(6, 2)
---
             num
count   6.000000
mean   23.666667
std    22.393451
min     6.000000
25%     9.000000
50%    12.000000
75%    37.500000
max    58.000000
---
   groups  num
0  Movies   46
1  Sports    8
2  Coding   12
---
    groups  num
3  Fishing   12
4  Dancing    6
5  cooking   58
---
Index(['groups', 'num'], dtype='object')
---
RangeIndex(start=0, stop=6, step=1)
---
<bound method DataFrame.info of     groups  num
0   Movies   46
1   Sports    8
2   Coding   12
3  Fishing   12
4  Dancing    6
5  cooking   58>

In [14]:
# Pandas 透過使用中括號 [] 與 .iloc 可以很靈活地從 data frame 中選擇想要的元素
# Python 在指定 0:1 時不包含 1，在指定 0:2 時不包含 2

import pandas as pd

groups = ["Movies", "Sports", "Coding", "Fishing", "Dancing", "cooking"]  
num = [46, 8, 12, 12, 6, 58]

dict = {"groups": groups,  
        "num": num
       }

select_df = pd.DataFrame(dict)

print(select_df.iloc[0, 1]) # 第一列第二欄：組的人數  
print("---")  
print(select_df.iloc[0:1,:]) # 第一列：組的組名與人數  
print("---")  
print(select_df.iloc[:,1]) # 第二欄：各組的人數  
print("---")  
print(select_df["num"]) # 各組的人數  
print("---")  
print(select_df.num) # 各組的人數

46
---
   groups  num
0  Movies   46
---
0    46
1     8
2    12
3    12
4     6
5    58
Name: num, dtype: int64
---
0    46
1     8
2    12
3    12
4     6
5    58
Name: num, dtype: int64
---
0    46
1     8
2    12
3    12
4     6
5    58
Name: num, dtype: int64

In [15]:
import pandas as pd

groups = ["Movies", "Sports", "Coding", "Fishing", "Dancing", "cooking"]  
num = [46, 8, 12, 12, 6, 58]

dict = {"groups": groups,  
        "num": num
        }

select_df = pd.DataFrame(dict)

out_df = select_df[select_df.loc[:,"num"] > 10] # 選出人數超過 10 的群組  
print(out_df)

    groups  num
0   Movies   46
2   Coding   12
3  Fishing   12
5  cooking   58

In [16]:
import pandas as pd # 引用套件並縮寫為 pd

groups = ["Movies", "Sports", "Coding", "Fishing", "Dancing", "cooking"]  
num = [46, 8, 12, 12, 6, 58]

dict = {"groups": groups,  
        "num": num
        }


select_df = pd.DataFrame(dict)

select_df.sort_index(axis = 0, ascending = True) # 透過索引值做排序，axis 可以指定第幾欄，ascending 用於設定升冪或降密

    groups  num
0   Movies   46
1   Sports    8
2   Coding   12
3  Fishing   12
4  Dancing    6
5  cooking   58

In [17]:
import pandas as pd # 引用套件並縮寫為 pd

groups = ["Movies", "Sports", "Coding", "Fishing", "Dancing", "cooking"]  
num = [46, 8, 12, 12, 6, 58]

dict = {"groups": groups,  
        "num": num
        }


select_df = pd.DataFrame(dict)

select_df.sort_values(by = 'num') #透過指定欄位的數值排序

    groups  num
4  Dancing    6
1   Sports    8
2   Coding   12
3  Fishing   12
0   Movies   46
5  cooking   58

2 DataFrame 的操作
❖ 資料描述查看
可以透過下列方法查看目前資料的資訊

.shape
.describe()
.head()
.tail()
.columns
.index
.info()
 資料選擇與篩選
可以透過下列方法選擇元素

中括號 [] 選擇元素
. 將變數當作屬性選擇
.loc .iloc 方法選擇
使用布林值篩選

 資料排序
可以使用的方法如下：

.sort_index()
.sort_values()


3 DataFrame 處理遺漏值
❖ 判斷是否為空值
可以使用下列兩種方法來判斷：

isnull()
notnull()

❖ 處理空值
可以使用下列兩種方法來填補空值：

dropna()
fillna()

# 修改columns名稱

In [18]:
df7=pd.DataFrame()
index = list('abcde')
for i in range(5):
    a2 = pd.DataFrame([np.linspace(i,5*i,5)], index = [index[i]])
    df7 = df7.append(a2)

# 修改columns名稱
df7.columns = ['x(new)', '10x(new)'] + list(df7.columns[2:])
print(df7)

   x(new)  10x(new)     2     3     4
a     0.0       0.0   0.0   0.0   0.0
b     1.0       2.0   3.0   4.0   5.0
c     2.0       4.0   6.0   8.0  10.0
d     3.0       6.0   9.0  12.0  15.0
e     4.0       8.0  12.0  16.0  20.0

# 產生測試資料 pd.util.testing

In [19]:
df8 = pd.util.testing.makeDataFrame().head(10)
df8

C:\Users\Hulk\AppData\Roaming\Python\Python37\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                   A         B         C         D
bjwpHhbHls -0.196593 -0.914167  0.863338 -0.035783
DOW1JMfOjL -0.911532 -0.712909 -0.315887  0.120525
cli861bV8S  0.212719 -0.344560  1.394181 -0.915251
3u0Upf6qYN -1.026613  0.022888  0.108104  0.000233
3WoYFd2enT -0.704325  0.042767  1.177753 -1.860286
C5w9skUjbN -0.259244 -0.786502 -0.875677  0.687769
VDEm460HVK -0.854579 -0.424844  0.820564 -1.119533
gUIDVNDnGe -1.141391 -0.692720 -1.755357  0.123313
mwpQyuahQ0 -0.101016 -0.670839 -1.106418 -2.530226
lrR2yZTi4A  1.279877  0.917804 -1.788524 -1.656086

# 將剪貼簿內容轉換成 DataFrame : pd.read_clipboard

In [20]:
Try by yourself. Look out "no reproducibility"

SyntaxError: invalid syntax (<ipython-input-20-edea7e07f0e5>, line 1)

# 顯示所有欄位以方便一次查看，可以透過 pd.set_option 函式

In [ ]:
df = pd.util.testing.makeCustomDataframe(5, 25)
df

# 顯示所有欄位以方便一次查看，可以透過 pd.set_option 函式

In [ ]:
pd.set_option("display.max_columns", None)
df

# 讀入特定的欄位並將已知的分類型（categorical）欄位轉成 category
## chunksize=4 表示一次讀入 4 筆樣本

In [ ]:
dtypes = {"Embarked": "category"}
cols = ['PassengerId', 'Name', 'Sex', 'Embarked']
df = pd.read_csv('http://bit.ly/kaggletrain', 
                 dtype=dtypes, usecols=cols)
df.info(memory_usage="deep")
df

In [ ]:
from IPython.display import display

# chunksize=4 表示一次讀入 4 筆樣本
reader = pd.read_csv('http://bit.ly/kaggletrain', 
                     chunksize=4, usecols=cols)
# 秀出前兩個 chunks
for _, df_partial in zip(range(2), reader):
    display(df_partial)

# pd.concat 將分散在不同 CSV 的乘客數據合併成單一 DataFrame
## reset_index 函式來重置串接後的 DataFrame 索引

# 為特定 DataFrame 加點樣式

In [ ]:
df = pd.read_csv('http://bit.ly/kaggletrain')
df

In [ ]:
df_sample = df.sample(n=20, random_state=9527).drop('Name', axis=1)
df_sample.Age.fillna(int(df.Age.mean()), inplace=True)
df_sample

In [ ]:
(df_sample.style
     .format('{:.1f}', subset='Fare')
     .set_caption('★五顏六色の鐵達尼號數據集☆')
     .hide_index()
     .bar('Age', vmin=0)
     .highlight_max('Survived')
     .background_gradient('Greens', 
                          subset='Fare')
     .highlight_null()
)

"""
將 Fare 欄位的數值顯示限制到小數後第一位
添加一個標題輔助說明
隱藏索引（注意最左邊！）
將 Age 欄位依數值大小畫條狀圖
將 Survived 最大的值 highlight
將 Fare 欄位依數值畫綠色的 colormap
將整個 DataFrame 的空值顯示為紅色
"""

# 數據清理
## fillna
## 使用 drop 函式來捨棄不需要的欄位。將 axis 設為 1, 刪除整欄, 否則刪除一列

In [ ]:
df = pd.util.testing.makeMissingDataframe().head()
print(df)
print(df.fillna(0))
print(df.fillna("Unknown"))

columns = ['B', 'D']
print(df.drop(columns, axis=1))
# print(df.drop('列名'))

# 將字串切割成多個欄位
## DataFrame 的 feature 欄位分成不同欄位，這時候利用 str 將字串取出，並透過 expand=True

In [ ]:
df = pd.DataFrame({
    "name": ["大雄", "胖虎"], 
    "feature": ["膽小, 翻花繩", "粗魯, 演唱會"]
})
print(df)
df[['性格', '特技']] = df.feature.str.split(',', expand=True)
print(df)

In [ ]:
df = pd.DataFrame({
    "name": ["大雄", "胖虎"], 
    "feature": [["膽小", "翻花繩"], ["粗魯", "演唱會"]]
})
print(df)
cols = ['性格', '特技']
df = pd.DataFrame(df.feature.tolist(), columns=cols)
print(df)

# 條件選取數據
## male_and_age_over_70 是我們定義的一個遮罩，可以把同時符合兩個布林判斷式（大於 70 歲、男性）的樣本選取出來
## df.query("Age > @age & Sex == 'male'")

In [ ]:
df = pd.read_csv('http://bit.ly/kaggletrain')
male_and_age_over_70 = (df.Sex == 'male') & (df.Age > 70)
(df[male_and_age_over_70]
    .style
    .applymap(lambda x: 'background-color: rgb(153, 255, 51)', 
              subset=pd.IndexSlice[:, 'Sex':'Age']))
# 跟 df[(df.Sex == 'male') & (df.Age > 70)] 結果相同

In [ ]:
df = pd.read_csv('http://bit.ly/kaggletrain')
age = 70
df.query("Age > @age & Sex == 'male'")

## 選出任一欄有空值的樣本

In [ ]:
df = pd.read_csv('http://bit.ly/kaggletrain')
df[df.isnull().any(axis=1)].head() \
    .style.highlight_null()

# 選取或排除特定類型欄位
## select_dtypes 函式

In [ ]:
df = pd.read_csv('http://bit.ly/kaggletrain')
df.select_dtypes(include='number').head()

# 選取所有出現在 list 內的樣本
## 使用 isin 函式

In [ ]:
df = pd.read_csv('http://bit.ly/kaggletrain')
tickets = ["SC/Paris 2123", "PC 17475"]
df[df.Ticket.isin(tickets)]

# 選取某欄位為 top-k 值的樣本
## 利用 value_counts 函式

In [ ]:
df = pd.read_csv('http://bit.ly/kaggletrain')
top_k = 3
top_tickets = df.Ticket.value_counts()[:top_k]
print(top_tickets.index)

df[df.Ticket.isin(top_tickets.index)].head()

# 找出符合特定字串的樣本
## 使用 str 底下的 contains 函式

In [ ]:
df = pd.read_csv('http://bit.ly/kaggletrain')
df[df.Name.str.contains("Mr\.")].head(5)

# 使用正規表示式選取數據
## filter 函式

In [ ]:
df_date = pd.util.testing.makeTimeDataFrame(freq='7D')
print(df_date.head(10))
print(df_date.filter(regex="2000-02.*", axis=0))

# 對某欄套用相同運算
## apply 函式

In [ ]:
# 重新讀取鐵達尼號數據
df_titanic = pd.read_csv('http://bit.ly/kaggletrain')
df_titanic = df_titanic.drop("Name", axis=1)

print(df)
# 複製一份副本 DataFrame
df = df_titanic.copy()
columns = df.columns.tolist()[:4]

# 好戲登場
new_col = '存活'
columns.insert(1, new_col)  # 調整欄位順序用
df[new_col] = df.Survived.apply(lambda x: '倖存' if x else '死亡')
print(df.loc[:10, columns])

df = df_titanic.copy()
display(df.head())

In [25]:
df_titanic = pd.read_csv('http://bit.ly/kaggletrain')
df = df_titanic.copy()
# apply custom function 可以說是 pandas 裡最重要的技巧之一
d = {'male': '男性', 'female': '女性'} 
def generate_desc(row):
    return f"一名 {row['Age']} 歲的{d[row['Sex']]}"

df['描述'] = df.apply(generate_desc, axis=1)
print(df.loc[:4, 'Sex':])

      Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked  \
0    male  22.0      1      0         A/5 21171   7.2500   NaN        S
1  female  38.0      1      0          PC 17599  71.2833   C85        C
2  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
3  female  35.0      1      0            113803  53.1000  C123        S
4    male  35.0      0      0            373450   8.0500   NaN        S

             描述
0  一名 22.0 歲的男性
1  一名 38.0 歲的女性
2  一名 26.0 歲的女性
3  一名 35.0 歲的女性
4  一名 35.0 歲的男性

# 將連續數值轉換成分類數據
## sort_values 函式

In [26]:
df = df_titanic.copy()

# 為了方便比較新舊欄位
columns = df.columns.tolist()
new_col = '年齡區間'
columns.insert(4, new_col)

# 將 numerical 轉換成 categorical 欄位
labels = [f'族群 {i}' for i in range(1, 11)]
df[new_col] = pd.cut(x=df.Age, 
                     bins=10, 
                     labels=labels)

# 可以排序切割後的 categorical 欄位
(df.sort_values(new_col, ascending=False)
   .reset_index()
   .loc[:5, columns]
)

,PassengerId,Survived,Pclass,Name,年齡區間,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",族群 10,male,80.0,0,0,27042,30.000,A23,S
1,852,0,3,"Svensson, Mr. Johan",族群 10,male,74.0,0,0,347060,7.775,NaN,S
2,457,0,1,"Millet, Mr. Francis Davis",族群 9,male,65.0,0,0,13509,26.550,E38,S
3,673,0,2,"Mitchell, Mr. Henry Michael",族群 9,male,70.0,0,0,C.A. 24580,10.500,NaN,S
4,117,0,3,"Connors, Mr. Patrick",族群 9,male,70.5,0,0,370369,7.750,NaN,Q
5,281,0,3,"Duane, Mr. Frank",族群 9,male,65.0,0,0,336439,7.750,NaN,Q

# 將 DataFrame 隨機切成兩個子集
##  pandas 解法，可以使用 sample 函式
        記得設定 random_state 以方便別人重現你的結果
### (機器學習)使用 scikit-learn 的 train_test_split 或是 numpy 的 np.random.randn

In [27]:
df_train = df_titanic.sample(frac=0.8, random_state=5566)
df_test = df_titanic.drop(df_train.index)

# 顯示結果，無特殊操作
display(df_train.head())
display(df_test.head())
print('各 DataFrame 大小：', 
      len(df_titanic), len(df_train), len(df_test))

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
294,295,0,3,"Mineff, Mr. Ivan",male,24.0,0,0,349233,7.8958,NaN,S
199,200,0,2,"Yrois, Miss. Henriette (""Mrs Harbeck"")",female,24.0,0,0,248747,13.0000,NaN,S
864,865,0,2,"Gill, Mr. John William",male,24.0,0,0,233866,13.0000,NaN,S
625,626,0,1,"Sutton, Mr. Frederick",male,61.0,0,0,36963,32.3208,D50,S
638,639,0,3,"Panula, Mrs. Juha (Maria Emilia Ojala)",female,41.0,0,5,3101295,39.6875,NaN,S

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14.0,0,0,350406,7.8542,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q

各 DataFrame 大小： 891 713 178

# 分組匯總結果 
## groupby 函式 分組
## describe 函式  統計數據

In [28]:
df = df_titanic.copy()
print(df.head())
df.groupby("Pclass").Age.mean()
# 你可以將所有乘客（列）依照它們的 Pclass 欄位值分組，並計算每組裡頭乘客們的平均年齡：

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [ ]:
df.groupby("Sex").Survived.describe()

In [ ]:
# 利用 size 函式迅速地取得各組包含的樣本數
df.groupby(["Sex", 'Pclass']).size().unstack()

In [ ]:
# agg 函式（aggregate，匯總）搭配 groupby 函式來將每一組樣本依照多種方式匯總
df.groupby(["Sex", 'Pclass']).Age.agg(['min', 'max', 'count'])

In [ ]:
# 透過 unstack 函式能讓你產生跟 pivot_table 函式相同的結果
df.groupby(["Sex", 'Pclass']).Age.agg(['min', 'max', 'count']).unstack()

In [ ]:
# 直接使用 pivot_table 函式來匯總各組數據
df.pivot_table(index='Sex', 
               columns='Pclass', 
               values='Age', 
               aggfunc=['min', 'max', 'count'])

In [ ]:
# 使用 transform 函式
"""
此例將所有乘客依照性別 Sex 分組之後，計算各組的平均年齡 Age，並利用 transform 函式將各組結果插入對應的乘客（列）裡頭。
你會發現兩名男乘客跟平均男性壽命 Avg_age 欄位相比正好一上一下，這差異則反映到 Above_avg_age 欄位裡頭。
"""

df = df_titanic.copy()
df['Avg_age'] = df.groupby("Sex").Age.transform("mean")
df['Above_avg_age'] = df.apply(lambda x: 'yes' if x.Age > x.Avg_age else 'no', 
                               axis=1)
# styling
(df.loc[:4, 'Sex':]
 .style
 .highlight_max(subset=['Avg_age'])
 .applymap(lambda x: 'background-color: rgb(153, 255, 51)', 
           subset=pd.IndexSlice[[0, 4], ['Age', 'Above_avg_age']])
)

# 對時間數據做匯總

In [21]:
df_date = pd.util.testing.makeTimeDataFrame(freq='Q').head(10) * 10
df_date

                    A          B          C          D
2000-03-31  -0.039363  11.301221   7.676424   4.782460
2000-06-30 -23.134704  -2.526271   8.153201  -9.480627
2000-09-30   7.727969  18.871989  -3.754449  15.618352
2000-12-31  -3.838971   3.897571  18.938566  -5.061296
2001-03-31 -13.508670   0.711912   2.231306  12.399270
2001-06-30   2.422698  -5.243578   7.099481  -1.703345
2001-09-30  12.198840  -0.497376 -12.396588  -9.485404
2001-12-31  -7.822120  12.764966   3.041204   2.836111
2002-03-31  -7.427397  -5.311870  15.277074 -19.326059
2002-06-30  -4.367157 -17.450696   7.149004  -9.073328

In [22]:
(df_date.resample('Y').A.max()
 .reset_index()
 .rename({'index': 'year'}, axis=1)
)

        year          A
0 2000-12-31   7.727969
1 2001-12-31  12.198840
2 2002-12-31  -4.367157

In [29]:
df['存活'] = df.Survived.apply(lambda x: '倖存' if x else '死亡')
df.loc[:5, 'Survived':'存活']

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,存活
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,死亡
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,倖存
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,倖存
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,倖存
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,死亡
5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,死亡

# qgrid：即時排序、篩選及編輯你的 DataFrame

In [35]:
import qgrid
qgrid.set_grid_option('maxVisibleRows', 7)
q = qgrid.show_grid(df_titanic)
print(q)

QgridWidget(grid_options={'fullWidthRows': True, 'syncColumnCellResize': True, 'forceFitColumns': True, 'defaultColumnWidth': 150, 'rowHeight': 28, 'enableColumnReorder': False, 'enableTextSelectionOnCells': True, 'editable': True, 'autoEdit': False, 'explicitInitialization': True, 'maxVisibleRows': 7, 'minVisibleRows': 8, 'sortable': True, 'filterable': True, 'highlightSelectedCell': False, 'highlightSelectedRow': True, 'boldIndex': True}, id='ef406cc4-11dc-4cb0-83a9-eae74add3f4b', precision=5)

# pandas-profiling：你的一鍵 EDA 神器
### 隨機抽樣 DataFrame 並用肉眼觀察樣本
了解樣本數有多少、各類型的變數有多少
了解 DataFrame 裡有多少空值
看數值欄位的分佈，欄位之間的相關係數
看分類型欄位的有多少不同的值，分佈為何
###

In [41]:
import pandas_profiling
df = df_titanic.copy()

# 一行報表：將想觀察的 DataFrame 丟進去就完工了
pandas_profiling.ProfileReport(df)

ModuleNotFoundError: No module named 'pandas_profiling'